#NAME_USER = input('Введите свое имя:')
#AGE_USER = input('Введите свой возраст:')


#print('Привет, я Наташа, мне 35 лет')
#print('Привет, я' ,NAME_USER, ', мне' , AGE_USER, 'лет')
#print('Привет, я ' + NAME_USER,', мне  ' +  str(AGE_USER), 'лет')
#print(f'Привет, я {NAME_USER},  мне {AGE_USER} лет')



# Напимать приложение: которое принимает два числа и складывает его. Результат от сложения вывести на экран
# Написать приложение которое принимает два числа и вычитает его. Результат выводит на экран
# Написать приложение которое принимает два числа и умножает его. Результат выводит на экран
# Написать приложение которое принимает два числа и делит его. Результат выводит на экран


#A = int (input('Введите число:'))
#B = int (input('Введите число:'))
#print(A + B)

#A = int (input('Введите число:'))
#B = int (input('Введите число:'))
#print(A - B)

#A = int (input('Введите число:'))
#B = int (input('Введите число:'))
#print(A * B)

#A = int (input('Введите число:'))
#B = int (input('Введите число:'))
#print(A / B)

#A = input('Введите число A:')
#B = input('Введите число B:')
#if A >= B:
   # print(True)
#else:
   # print(False)


#password = 123456
#pass_user = int(input('Введите пароль:'))

#if pass_user == password:
  #  print('Доступ разрешен')
#else:
   # print('Неверный пароль')


degree_Celsius = int(input('Введите значение'))
degree_Fahrenheit = degree_Celsius +32

print(degree_Fahrenheit)
