# NAME_USER = input('Введите свое имя: ')
# AGE_USER = input('Введите свой возраст: ')
#
#
# print('Привет, я Максим, мне 30 лет')
# print('Привет, я', NAME_USER, 'мне,', AGE_USER, 'лет')
# print('Привет, я ' + NAME_USER + ' мне, ' + str(AGE_USER) + ' лет')
# print(f'Привет, я {NAME_USER} мне, {AGE_USER} лет')




A = input('Введите число А: ')
B = input('Введите число В: ')

if A != B:
    print('Числа не равны')
else:
    print('Числа равны')




# Программа спрашивает пользователя пароль (например 123456). Если пароль верный, выводить "Доступ разрешен", иначе - "Неверный пароль"
# Пользователь вводит температуру в градусах цельсия: а программа должна переводить ее в градусах по фаренгейту


# Арефметические операторы
# + сложение
# - вычетание
# * умножение
# / деление (вещественное)
# // деление (целочисленное)
# % остаток от деления
# ** возведение в степень


# Операторы сравнения
# == равно
# != не равно
# > больше
# < меньше
# >= больше или равно
# <= меньше или равн

# Логические операторы
# and логическое И
# or логическое ИЛИ
# not логическое НЕ


# Операторы присвоения
# = прострое сравнение
# += прибовление и присвоение
# -= вычетание и присвоение
# *= умножение и присвоение
# /= деление и присвоение
# //= целочисленное деление и присвоение
# %= остаток от деления и присвоение
# **= возведение в степень и присвоение

# Битовые операторы
# & битовое И
# | битовое ИЛИ
# ^ битовое искючене
# ~ битовое НЕ
# << Сдвиг влево
# >> сдивг вправо

