#Напишите функцию is_even(n), которая:

# Принимает целое число n
# Возвращает True, если число чётное
# Возвращает False, если число нечётное
# Обрабатывает отрицательные числа




def isEven(n):
    return n%2 == 0
print(isEven(-3))
