def test_сложение():
    assert 2 + 2 == 4

#assert - утвердительное предложение

def test_деление():
    assert 10/2 == 5

def test_список():
    слова = ["тест", "код", "pytest"]

    assert "pytest" in слова

#фекстура - шаблон для проверки

@pytest.fixture
def список_студентов():
    return ["Аня", "Борис", "Виктор"]

def test_первый_студент (список_студентов):
    assert список_студентов [0] == "Аня"

@pytest.mark.parametrize("a, b, ожидаемый", [(1, 1, 2),
                                            (0, 5, 5),
                                            (-1, 3, 2),
                                            ])
def test_сложение(a, b, ожидаемый):
    assert a + b == ожидаемый